Tekla Open API Reference for Tekla Structures 2025
IEvents Interface
 Interface for the Events class allows the user to register event listeners for Drawings events. This interface allows the Marshaling of the Events class with Trimble.Remoting
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public interface IEvents
Public Interface IEvents
The IEvents type exposes the following members.
Methods
Name | Description
Register
 Registers the instance to listen to the specified events.
UnRegister
 Unregisters the instance from listening to events.
Top
Events
Name | Description
DrawingChanged
 The DrawingChanged event is raised when the drawing has been changed and the database is committed.
DrawingDeleted
 The DrawingDeleted event is raised when a drawing has been deleted.
DrawingInserted
 The DrawingInserted event is raised when a drawing has been inserted.
DrawingReadyForIssuingChange
 The DrawingReadyForIssuingChange event is raised just after a drawing is marked or unmarked ready for issuing.
DrawingStatusChanged
 The DrawingStatusChanged event is raised when the drawing status has changed.
DrawingUpdated
 The DrawingUpdated event is raised when the drawing has been inserted, deleted or modified, and the database is committed.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace